Revit 2027 API
PanelScheduleData.GetNumberOfCircuitRows Method
 Gets the number of rows in the circuit table
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfCircuitRows()
Public Function GetNumberOfCircuitRows As Integer
public:
int GetNumberOfCircuitRows()
member GetNumberOfCircuitRows : unit -> int
Return Value
Int32
 The number of rows
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace